#+TITLE: model hypothesis testing

*** names
 
 #+BEGIN_SRC R  :session *ansi-term*  
names(mod1) 
 #+END_SRC 

 #+RESULTS:
 | aodid              |
 | day                |
 | stn                |
 | c                  |
 | long_pm25          |
 | lat_pm25           |
 | stn.elev           |
 | pm25               |
 | closest            |
 | m                  |
 | aod                |
 | UN                 |
 | QA                 |
 | Year               |
 | pop06              |
 | pcturb             |
 | elev_m             |
 | distA1             |
 | wflag              |
 | tden               |
 | tempavg            |
 | wsavg              |
 | rhavg              |
 | rainday            |
 | PBL                |
 | season             |
 | seasonSW           |
 | ndvi               |
 | obs                |
 | long_aod.x         |
 | lat_aod.x          |
 | meanPM25           |
 | meanPM10           |
 | reg                |
 | region.x           |
 | normwt             |
 | numadata           |
 | flag1000           |
 | flag500            |
 | tden.s             |
 | elev.s             |
 | pden.s             |
 | da1.s              |
 | ndvi.s             |
 | pbl.s              |
 | p_urb.s            |
 | temp.s             |
 | winds.s            |
 | rh.s               |
 | rain.s             |
 | emsid              |
 | dair               |
 | dport              |
 | X                  |
 | Y                  |
 | lat_aod.y          |
 | long_aod.y         |
 | id                 |
 | region.y           |
 | dist_train         |
 | dist.aroad         |
 | dist.coast         |
 | dist.wb            |
 | Height class (1-5) |
 | long_ems           |
 | lat_ems            |
 | NO2                |
 | NMVOC              |
 | SO2                |
 | NH3                |
 | PM2.5              |
 | PM10               |
 | CO                 |
 | Pb                 |
 | Cd                 |
 | Hg                 |
 | PCD                |
 | p.agric            |
 | p.opem             |
 | p.urban            |
 | p.forest           |
 | reg.y              |
 | pmreg              |
 | cid                |
 | c2id               |
 | pmzsimpid          |
 | cmidsimp           |
 | dair.s             |
 | dport.s            |
 | dtrain.s           |
 | daroad.s           |
 | dcoast.s           |
 | dwb.s              |
 | NO2.s              |
 | SO2.s              |
 | PM25ems.s          |
 | PM10ems.s          |
 | p.agric.s          |
 | p.open.s           |
 | p.urban.s          |
 | p.forest.s         |
 | dair.l             |
 | dport.l            |
 | dtrain.l           |
 | daroad.l           |
 | dcoast.l           |
 | dwb.l              |
 | NO2.l              |
 | SO2.l              |
 | PM25ems.l          |
 | PM10ems.l          |
 | p.agric.l          |
 | p.open.l           |
 | p.urban.l          |
 | p.forest.l         |
 | tden.l             |
 | elev.l             |
 | pden.l             |
 | da1.l              |
 | ndvi.l             |
 | pbl.l              |
 | winds.l            |
 | rh.l               |
 | rain.l             |
 | aod.l              |
 | temp.l             |
 | badid              |
 | pred.m1            |

 
